class Answer {
  static int _nextId = 0;
  int id = -1;
  String text = '';
  bool isTrue = false;

  //getters
  String get A_text {
    return text;
  }

  int get A_id {
    return id;
  }

  bool get A_isTrue {
    return isTrue;
  }

  //constructor
  Answer(String text, bool isTrue) {
    this.id = ++_nextId;
    this.text = text;
    this.isTrue = isTrue;
  }
}

class Question {
  //fields
  static int _nextId = 0;
  static Map<String, int> _nextImageId = {};
  bool hasImage = false;
  int id = -1;
  int imageId = -1;
  String category = '-1';
  String text = '';
  List<Answer> answers = [];

  //getters
  String get Q_text {
    return text;
  }

  bool get Q_hasImage {
    return hasImage;
  }

  String? get Q_category {
    return _categories[category];
  }

  String get Raw_category {
    return category;
  }

  String get Q_imagePath {
    return 'assets/quizImgs/${category}.${imageId}.jpg';
  }

  int get Q_id {
    return id;
  }

  List get Q_answers {
    return answers;
  }

  //constructors
  Question(String category, bool hasImage, String text, List<Answer> answers) {
    this.id = ++_nextId; // Αυτόματη αύξηση id για προστασία από λογικά λάθη
    this.category = category;

    //Αυξηση counter φωτογραφιας ανα κατηγορια (1.1/1.2...2.1/2.2 etc)
    if (_nextImageId[this.category] == null) {
      _nextImageId[this.category] = 0;
    }
    if (hasImage) {
      _nextImageId[this.category] = _nextImageId[this.category]! + 1;
      this.imageId = _nextImageId[this.category]!;
    }
    this.hasImage = hasImage;
    this.text = text;
    this.answers = answers;
  }
}

final _categories = {
  "-1": "Δεν βρέθηκε κατηγορια",
  "1": "ΤΑ ΚΥΡΙΑ ΟΡΓΑΝΑ ΤΟΥ ΟΧΗΜΑΤΟΣ ΚΑΙ ΤΑ ΧΕΙΡΙΣΤΗΡΙΑ ΣΤΟ ΧΩΡΟ ΟΔΗΓΗΣΕΩΣ",
  "2": "Η ΕΓΚΑΤΑΣΤΑΣΗ ΣΤΗ ΘΕΣΗ ΤΟΥ ΟΔΗΓΟΥ",
  "3": "Η ΣΗΜΑΝΣΗ",
  "4": "ΟΙ ΔΙΑΣΤΑΥΡΩΣΕΙΣ",
  "5": "Η ΤΑΧΥΤΗΤΑ",
  "6": "Η ΘΕΣΗ ΣΤΟ ΟΔΟΣΤΡΩΜΑ",
  "7": "ΟΙ ΑΠΟΣΤΑΣΕΙΣ ΑΣΦΑΛΕΙΑΣ",
  "8": "ΣΤΑΣΗ ΚΑΙ ΣΤΑΘΜΕΥΣΗ",
  "9": "ΔΙΑΣΤΑΥΡΩΝΕΣΤΕ, ΠΡΟΣΠΕΡΝΑΤΕ, ΣΑΣ ΠΡΟΣΠΕΡΝΟΥΝ",
  "10": "ΟΙ ΣΤΡΟΦΕΣ",
  "11": "Η ΣΥΝΗΠΑΡΞΗ ΜΕ ΤΟΥΣ ΑΛΛΟΥΣ ΧΡΗΣΤΕΣ ΤΗΣ ΟΔΟΥ",
  "12": "ΑΚΟΛΟΥΘΩΝΤΑΣ ΜΙΑ ΔΙΑΔΡΟΜΗ",
  "13": "ΤΟ ΑΛΚΟΟΛ ΚΑΙ ΑΛΛΕΣ ΧΗΜΙΚΕΣ ΟΥΣΙΕΣ, ΦΑΡΜΑΚΑ",
  "14": "Η ΕΙΣΟΔΟΣ ΣΤΗΝ ΚΥΚΛΟΦΟΡΙΑ",
  "15": "Ο ΑΥΤΟΚΙΝΗΤΟΔΡΟΜΟΣ",
  "16": "Η ΟΔΗΓΗΣΗ ΜΕ ΠΕΡΙΟΡΙΣΜΕΝΗ ΟΡΑΤΟΤΗΤΑ",
  "17": "ΟΔΗΓΩΝΤΑΣ ΜΕ ΜΕΙΩΜΕΝΗ ΠΡΟΣΦΥΣΗ",
  "18": "ΟΔΗΓΗΣΗ ΣΕ ΒΟΥΝΟ",
  "19": "Η ΚΟΥΡΑΣΗ ΚΑΙ Η ΕΤΟΙΜΟΤΗΤΑ",
  "20": "Η ΣΥΜΠΕΡΙΦΟΡΑ ΣΕ ΑΤΗΧΥΜΑ",
  "21": "ΣΥΝΤΗΡΗΣΗ ΚΑΙ ΕΠΙΣΚΕΥΗ",
  "22": "ΟΙ ΕΚΤΑΚΤΕΣ ΚΑΤΑΣΤΑΣΕΙΣ",
  "23": "ΠΡΟΣΤΑΣΙΑ ΠΕΡΙΒΑΛΛΟΝΤΟΣ - ΕΞΟΙΚΟΝΟΜΗΣΗ ΕΝΕΡΓΕΙΑΣ",
};
// Question('2', true, '', [Answer('', false), Answer('', false), Answer('', false)]),

List questions1 = [
  Question(
      '1',
      false,
      'Οδηγείτε με την 4η ταχύτητα, ο κινητήρας δυσκολεύεται (σκορτσάρει) και κινδυνεύει να σταματήσει εντελώς τότε:',
      [
        Answer('Περνάτε στην 3η ταχύτητα.', true),
        Answer('Περνάτε στην 5η ταχύτητα.', false)
      ]),
  Question(
      '1',
      false,
      'Εάν συγκρίνετε το τιμόνι με την αριθμημένη οθόνη ενός ωρολογίου με δείκτες, η σωστή θέση των χεριών, σε ευθεία πορεία, τοποθετείται στις',
      [
        Answer('Εννέα και τέταρτο ως δέκα και δέκα.', true),
        Answer('Εννέα.', false),
        Answer('Εντεκα και πέντε.', false)
      ]),
  Question(
      '1', false, 'Οταν περιμένετε να ανάψει το πράσινο φως του σηματοδότη:', [
    Answer(
        'Εχετε «βάλει» την 1η ταχύτητα και πιέζετε τον ποδομοχλό του συμπλέκτη.',
        false),
    Answer(
        'Εχετε το μοχλό ταχυτήτων στη «νεκρά» και πιέζετε τον ποδομοχλό της πέδης (φρένο).',
        true),
    Answer(
        'Εχετε το μοχλό ταχυτήτων στη «νεκρά» και πιέζετε τον ποδομοχλό του συμπλέκτη.',
        false)
  ]),
  Question(
      '1',
      false,
      'Σε ποιες περιπτώσεις έχετε υποχρέωση να χρησιμοποιήσετε τους δείκτες αλλαγής κατευθύνσεως (φλας) του οχήματός σας:',
      [
        Answer(
            'Μόνο όταν έχετε πρόθεση να αλλάξετε κατεύθυνση προς τα αριστερά.',
            false),
        Answer(
            'Μόνο όταν έχετε πρόθεση να αλλάξετε λωρίδα κυκλοφορίας ή κατεύθυνση.',
            false),
        Answer('Πριν από κάθε αλλαγή κατευθύνσεως ή ελιγμό.', true)
      ]),
  Question(
      '1',
      false,
      'Σε κανονική πορεία που δεν απαιτείται συχνή αλλαγή ταχυτήτων, το αριστερό πόδι:',
      [
        Answer(
            'Παραμένει πάνω στον ποδομοχλό του συμπλέχτη χωρίς να τον πιέζει.',
            false),
        Answer('Μένει ακίνητο απέναντι από τον ποδομοχλό.', false),
        Answer('Μένει ακίνητο στα αριστερά του ποδομοχλού.', true)
      ]),
  Question(
      '1',
      false,
      'Πώς µπορείτε να μεταφέρετε κατά το δυνατόν ασφαλέστερα µε το επιβατηγό σας αυτοκίνητο ένα μικρό παιδί:',
      [
        Answer('Στη θέση του συνοδηγού.', false),
        Answer(
            'Στην αγκαλιά ενός προσώπου που κάθεταιστο εμπρός κάθισμα.', false),
        Answer(
            ' Στο πίσω κάθισμα, σε ένα εγκεκριµµένου τύπου, για το σκοπό αυτό, παιδικό κάθισμα. ',
            true)
      ]),
  Question(
      '1',
      false,
      'Τι µπορεί να συμβεί, εάν επιβάτες που κάθονται στο πίσω κάθισμα, δεν χρησιμοποιούν τις υπάρχουσες ζώνες ασφαλείας:',
      [
        Answer(
            'Σε µία σύγκρουση δημιουργούν για τον οδηγό και τον συνοδηγό ένα πρόσθετο κίνδυνο τραυματισμού.',
            true),
        Answer(
            'Τίποτα διότι τα μαξιλάρια κεφαλής των μπροστινών καθισμάτων προσφέρουν επαρκή προστασία από τραυματισμούς.',
            false),
      ]),
  Question(
      '1',
      false,
      'Σε πόση απόσταση τουλάχιστον πρέπει να φωτίζουν επαρκώς την οδό, µε συνθήκες αιθρίας, κατά τη νύχτα τα φώτα πορείας (μεγάλα) του αυτοκινήτου:',
      [Answer('100m', true), Answer('40m', false), Answer('300m', false)]),
  Question(
      '1',
      false,
      'Τι πρέπει να προσέχει ο οδηγός κατά τη χρησιµοποίηση των καθρεπτών ενός επιβατηγού:',
      [
        Answer(
            'Ο εσωτερικός καθρέπτης καθιστά πάντα δυνατή την πλήρη ορατότητα προς τα δεξιά.',
            false),
        Answer(
            'Σε µία ορισμένη περιοχή (νεκρή γωνία) είναι δυνατόν να µην είναι ορατά αυτοκίνητα που προσπερνούν',
            true)
      ]),
  Question(
      '1',
      false,
      'Ο ήχος που εκπέµπεται από το ηχητικό όργανο του οχήµατος (κόρνα) πρέπει να είναι:',
      [
        Answer('Συνεχής µε ίδιο τόνο.', true),
        Answer('Διαπεραστικός.', false),
        Answer('Ἐναλλασσόμενος', false)
      ]),
  Question(
      '1',
      false,
      'Η χρήση ζώνης ασφαλείας είναι απαραίτητη και από τους επιβάτες των πίσω καθισμάτων:',
      [
        Answer('Ναι, γιατί δεν προστατεύονται σε περίπτωση ατυχήματος.', true),
        Answer('Όχι, γιατί δεν προβλέπεται στον Κ.Ο.Κ.', false),
        Answer('΄Οχι, γιατί προστατεύονται από τα μπροστινά καθίσµατα.', false)
      ]),
  Question('1', false, 'Ποια είναι τα φώτα διασταυρώσεως του αυτοκινήτου:', [
    Answer(' Τα φώτα που έχουν εμβέλεια τουλάχιστον 100m', false),
    Answer('Τα φώτα που έχουν εμβέλεια τουλάχιστον 40m', true),
    Answer('Τα μικρά φώτα στο εμπρόσθιο µέρος.', false)
  ]),
  Question(
      '1',
      false,
      'Όταν δεν λειτουργούν τα φώτα τροχοπεδήσεως του οχήµατός σας, µε ποιον τρόπο οφείλετε να ειδοποιησετε αυτόν που ακολουθεί, ότι έχετε πρόθεση να σταθµεύσετε:',
      [
        Answer('Χρησιμοποιώντας τα φώτα οπισθοπορείας.', false),
        Answer('Κάµπτοντας το βραχίονα προς τα κάτω.', true),
        Answer('Κάµπτοντας το βραχίονα προς τα πάνω. ', false)
      ]),
  Question(
      '1',
      false,
      'Τι πρέπει να προσέχει ο οδηγός κατά τη χρησιµοποίηση του καθρέπτη ενός επιβατηγού:',
      [
        Answer(
            'Οι καθρέπτες πρέπει να είναι προσαρµοσµέγοι στον εκάστοτε οδηγό.',
            true),
        Answer(
            'Ο εσωτερικός καθρέπτης καθιστά πάντα δυνατή τη πλήρη ορατότητα προς τα δεξιά.',
            false)
      ]),
];
List questions = [
  Question('2', true, 'Η νεκρή γωνία είναι µια περιοχή:', [
    Answer('Μη ορατή από τη θέση του οδηγού µέσω των καθρεπτών.', true),
    Answer('Ορατή µέσω των καθρεπτών.', false),
    Answer('Μη ορατή µε λοξή µατιά πάνω από τους ώμους.', false)
  ]),
  Question('2', true, 'Για να εγκατασταθείτε σωστά στη θέση του οδηγού:', [
    Answer(
        'Πρέπει να µπορείτε να ακουµπάτε τους καρπούς των χεριών σας στο επάνω µέρος του τιμονιού και να µπορείτε να πατάτε ὠς το τέρμα το συμπλέκτη.',
        true),
    Answer('Πρέπει να µπορείτε να ακουµπάτε τα χέρια σας στον πίνακα ελέγχου.',
        false)
  ]),
  Question(
      '2',
      false,
      'Ένα ογκώδες αντικείµενο δεν επιτρέπεται να εξέχει προς τα πίσω περισσότερο του 30% του μήκους του οχήματος χωρίς ειδική άδεια:',
      [Answer('ΝΑΙ ', true), Answer('ΟΧΙ', false)]),
  Question('2', false, 'Για να επιβιβασθείτε στο όχηµά σας:', [
    Answer('Γυρνάτε την πλάτη σας στην κυκλοφορία της κατευθύνσεώς σας', false),
    Answer(
        'Βρίσκεστε µε πρόσωπο προς την κυκλοφορία της κατευθύνσεώς σας.', true)
  ]),
  Question(
      '2', false, 'Εάν αλλάζετε λωρίδα, για να ελέγξετε καλά προς τα πίσω: ', [
    Answer('Σας αρκούν οι καθρέπτες.', false),
    Answer('Κοιτάτε µόνο τον εξωτερικό καθρέπτη.', false),
    Answer(
        'Ελέγχετε µε τους καθρέπτες και γυρνάτε το κεφάλι στην πλευρά που θα μπείτε.',
        true)
  ]),
  Question('2', false, 'Τα λαστιχάκια των υαλοκαθαριστήρων αντικαθίστανται:', [
    Answer(
        ' Κάθε φορά που έχουν φθαρεί και τουλάχιστον µια φορά το χρόνο, κατά προτίμηση πριν το χειμώνα.',
        true),
    Answer('Κατά προτίμηση το καλοκαίρι.', false)
  ]),
  Question(
      '2',
      false,
      'Για την ασφάλεια του παιδιού σας, µπορείτε να χρησιμοποιήσετε ανάλογα µε το ύψος, το βάρος και την ηλικία του:',
      [
        Answer(
            'Τα εγκεκριµένου τύπου παιδικά καθίσματα για το αυτοκίνητο.', true),
        Answer('Το δίχτυ ανάµεσα στα μπροστινά καθίσματα.', false)
      ]),
  Question(
      '2',
      false,
      'Οδηγείτε µε το επιβατηγό σας λίγο γρηγορότερα από την ταχύτητα βαδίσµατος. Οι ζώνες ασφαλείας πρέπει να δεθούν:',
      [
        Answer('Όχι, σε διαδρομές µέσα σε κατοικημένες περιοχές.', false),
        Answer('Ναι, σε κάθε διαδρομή. ', true),
        Answer(
            'Μόνο σε διαδρομές στους αυτοκινητόδροµους και δρόμους ταχείας κυκλοφορίας.',
            false)
      ]),
  Question(
      '2',
      false,
      ' Ένα επιβατηγό είναι εφοδιασμένο µε ζώνες ασφαλείας για όλες του τις θέσεις. Ποια πρόσωπα πρέπει να  τις φορέσουν:',
      [
        Answer('Ο οδηγός και οι επιβάτες των εμπροσθίων καθισμάτων.', false),
        Answer('Μόνο ο οδηγός.', false),
        Answer('Ο οδηγός και όλοι οι επιβάτες.', true)
      ]),
];
